{"pageProps":{"projects":[{"abstract":[{"_key":"55634658b0de","_type":"block","children":[{"_key":"65c6803c1457","_type":"span","marks":[],"text":"React, NodeJS, Express, Mongo, Google Maps, Auth0, Bootstrap"}],"markDefs":[],"style":"normal"},{"_key":"639533c6c3d5","_type":"block","children":[{"_key":"e877bf1881c4","_type":"span","marks":[],"text":"Tool Time is a React application and could-based database for the purpose of sharing (physical) tools on a neighborhood-scale. Everything is open source and hosted through GitHub with a MIT license. It was built with a team of four over the course of a week during my time at Codefellows."}],"markDefs":[],"style":"normal"},{"_key":"951fc03691fd","_type":"block","children":[{"_key":"cd8a58434451","_type":"span","marks":[],"text":"Our idea came from a feeling that many of the tools we owned were under utilized. We sat down and came up with some sketches. What if we could build a service that would allow groups or individuals to lend or stockpile tools. Every tool is registered to a person and is fully traceable. You'd be able to find or return the tool at any time. It felt like something that could scale: a sweet idea.\n\nI contributed to the project's view logic and backend infrastructure, though the most work went into the API. Our Node.js backend was written with the help of the Express framework, and was required to be fully CRUD performant."}],"markDefs":[],"style":"normal"},{"_key":"f5ad7295bf63","_type":"block","children":[{"_key":"0ec580975ccc","_type":"span","marks":[],"text":"Team roles were loosely defined. Most of our work as a team was done during pair programming sessions. These were conducted as two to three hour sessions capped by a standup and retrospective; in other words, we followed an agile work flow. \n"}],"markDefs":[],"style":"normal"}],"mainImage":{"_type":"image","asset":{"_ref":"image-ff101d7947fe84ff6b9f4d14086ac031b117fb29-500x500-png","_type":"reference"}},"projectURL":"https://angry-kalam-ff501e.netlify.app/","publishedAt":"2021-05-24T23:46:00.000Z","repoURL":"https://github.com/Tool-Time","slug":null,"title":"Tool Time"},{"abstract":[{"_key":"423770a05100","_type":"block","children":[{"_key":"7a164797b2d7","_type":"span","marks":[],"text":"React, SCSS,  Auth0, Bootstrap, NodeJS, Express, Jest, Heroku, Netlify"}],"markDefs":[],"style":"normal"},{"_key":"346f18b921f5","_type":"block","children":[{"_key":"3cda473cd391","_type":"span","marks":[],"text":"Bounty is a social network built around sharing recipes; more specifically, sharing and creating recipes for cold treats. Bounty's purpose is to crowd-source hard to find or non-existent recipes. Fulfill your cream-based cravings, and maybe make some friends on the way."}],"markDefs":[],"style":"normal"},{"_key":"062d752e7115","_type":"block","children":[{"_key":"6aa9d8751895","_type":"span","marks":[],"text":"For this team project, I took the helm contributing to API design. The routes and database connection were configured by myself, and I oversaw our handshake with our front-end. There was a lot of time spent programming in pairs, which helped me greatly. We learned together and caught bugs early."}],"markDefs":[],"style":"normal"},{"_key":"1cb903f8f247","_type":"block","children":[{"_key":"7e447ea175d8","_type":"span","marks":[],"text":"Bounty was built with TTD as a core principle. The back-end my teammates and I built rested on a suite of automated tests written with Jest. We'd just been exposed to front-end and BDD testing. As a result, the front-end is untested."},{"_key":"5eb9f48cd5c2","_type":"span","marks":[],"text":""}],"markDefs":[],"style":"normal"}],"mainImage":{"_type":"image","asset":{"_ref":"image-9d6da5d366b484f886055803d8dc84cabfc876d7-1552x930-png","_type":"reference"}},"projectURL":"https://bounty-ice-cream.netlify.app/","publishedAt":"2021-08-24T00:41:00.000Z","repoURL":"https://github.com/Creams-Quad","slug":null,"title":"Bounty"}]},"__N_SSG":true}